In [274]:
import pandas as pd

train_data = pd.read_csv('my_data.csv')

train_data.describe()

,Id,Area,Bedrooms,year_of_house,Bathroom,floor,SalePrice
count,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000,7.000000
mean,4.000000,3857.142857,2.714286,8.571429,2.142857,1.714286,43000.000000
std,2.160247,1345.185418,0.951190,6.852181,0.377964,0.755929,15448.840302
min,1.000000,2000.000000,2.000000,1.000000,2.000000,1.000000,25000.000000
25%,2.500000,3000.000000,2.000000,4.000000,2.000000,1.000000,31000.000000
50%,4.000000,4000.000000,2.000000,6.000000,2.000000,2.000000,40000.000000
75%,5.500000,4500.000000,3.500000,12.500000,2.000000,2.000000,55000.000000
max,7.000000,6000.000000,4.000000,20.000000,3.000000,3.000000,64000.000000

In [275]:
train_data.head()

   Id  Area  Bedrooms  year_of_house  Bathroom  floor  location  SalePrice
0   1  2000         2             10         2      1     Salem      25000
1   2  4000         2             15         2      1     Erode      35000
2   3  4000         4              6         2      2  Namakkal      60000
3   4  3000         2              5         2      1     Salem      27000
4   5  5000         4             20         3      2     Erode      50000

In [276]:
home_data_features = ['Area']
home_data= train_data[home_data_features]
home_data.describe()

              Area
count     7.000000
mean   3857.142857
std    1345.185418
min    2000.000000
25%    3000.000000
50%    4000.000000
75%    4500.000000
max    6000.000000

In [277]:
y = train_data['SalePrice']
y.describe()

count        7.000000
mean     43000.000000
std      15448.840302
min      25000.000000
25%      31000.000000
50%      40000.000000
75%      55000.000000
max      64000.000000
Name: SalePrice, dtype: float64

In [278]:
y.head()

0    25000
1    35000
2    60000
3    27000
4    50000
Name: SalePrice, dtype: int64

In [279]:
print(home_data.dtypes)

Area    int64
dtype: object

In [280]:
from sklearn.linear_model import LinearRegression

model = LinearRegression()
model.fit(home_data, y)

model_prediction = model.predict(home_data)

print("Actual House Price: ", y.to_list)
print("Predicted House Price: ", model_prediction)

Actual House Price:  <bound method IndexOpsMixin.tolist of 0    25000
1    35000
2    60000
3    27000
4    50000
5    64000
6    40000
Name: SalePrice, dtype: int64>
Predicted House Price:  [25210.52631579 44368.42105263 44368.42105263 34789.47368421
 53947.36842105 63526.31578947 34789.47368421]

In [281]:
from sklearn.model_selection import train_test_split

train_X, val_X, train_y, val_y = train_test_split(home_data, y, test_size=0.2)

print(train_X)
print(train_y)
print(val_X)
print(val_y)

   Area
6  3000
4  5000
0  2000
5  6000
1  4000
6    40000
4    50000
0    25000
5    64000
1    35000
Name: SalePrice, dtype: int64
   Area
2  4000
3  3000
2    60000
3    27000
Name: SalePrice, dtype: int64

In [282]:
from sklearn.linear_model import LinearRegression

val_model = LinearRegression()
val_model.fit(train_X, train_y)

val_prediction =val_model.predict(val_X)

print(val_prediction)
print(val_y)

[42800. 34000.]
2    60000
3    27000
Name: SalePrice, dtype: int64

In [283]:
from sklearn.metrics import mean_squared_error, r2_score
abs_mean = mean_squared_error(val_y, val_prediction)
abs_r2 = r2_score(val_y,val_prediction)
print(abs_mean)
print(abs_r2)

172420000.0
0.3666850321395776

In [284]:
test_datas = pd.read_csv('my_test.csv')
test_data = test_datas[home_data_features]
test_data.describe()

              Area
count     3.000000
mean   3033.333333
std    1305.118130
min    2000.000000
25%    2300.000000
50%    2600.000000
75%    3550.000000
max    4500.000000

In [285]:
test_data.head()

   Area
0  4500
1  2600
2  2000

In [289]:
final_model = LinearRegression()
final_model.fit(home_data,y)
result = final_model.predict(test_data)
print(result)

[49157.89473684 30957.89473684 25210.52631579]